HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN28 */
#define IFX_VADC_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN28 */
#define IFX_VADC_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN28 */
#define IFX_VADC_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN29 */
#define IFX_VADC_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN29 */
#define IFX_VADC_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN29 */
#define IFX_VADC_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN2 */
#define IFX_VADC_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN2 */
#define IFX_VADC_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN2 */
#define IFX_VADC_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN30 */
#define IFX_VADC_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN30 */
#define IFX_VADC_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN30 */
#define IFX_VADC_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN31 */
#define IFX_VADC_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN31 */
#define IFX_VADC_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN31 */
#define IFX_VADC_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN3 */
#define IFX_VADC_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN3 */
#define IFX_VADC_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN3 */
#define IFX_VADC_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN4 */
#define IFX_VADC_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN4 */
#define IFX_VADC_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN4 */
#define IFX_VADC_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN5 */
#define IFX_VADC_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN5 */
#define IFX_VADC_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN5 */
#define IFX_VADC_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN6 */
#define IFX_VADC_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN6 */
#define IFX_VADC_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN6 */
#define IFX_VADC_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN7 */
#define IFX_VADC_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN7 */
#define IFX_VADC_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN7 */
#define IFX_VADC_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN8 */
#define IFX_VADC_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN8 */
#define IFX_VADC_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN8 */
#define IFX_VADC_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN9 */
#define IFX_VADC_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN9 */
#define IFX_VADC_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN9 */
#define IFX_VADC_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC0 */
#define IFX_VADC_ACCPROT0_APC0_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC0 */
#define IFX_VADC_ACCPROT0_APC0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC0 */
#define IFX_VADC_ACCPROT0_APC0_OFF (0)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC10 */
#define IFX_VADC_ACCPROT0_APC10_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC10 */
#define IFX_VADC_ACCPROT0_APC10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC10 */
#define IFX_VADC_ACCPROT0_APC10_OFF (10)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC1 */
#define IFX_VADC_ACCPROT0_APC1_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC1 */
#define IFX_VADC_ACCPROT0_APC1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC1 */
#define IFX_VADC_ACCPROT0_APC1_OFF (1)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC2 */
#define IFX_VADC_ACCPROT0_APC2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC2 */
#define IFX_VADC_ACCPROT0_APC2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC2 */
#define IFX_VADC_ACCPROT0_APC2_OFF (2)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC3 */
#define IFX_VADC_ACCPROT0_APC3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC3 */
#define IFX_VADC_ACCPROT0_APC3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC3 */
#define IFX_VADC_ACCPROT0_APC3_OFF (3)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC4 */
#define IFX_VADC_ACCPROT0_APC4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC4 */
#define IFX_VADC_ACCPROT0_APC4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC4 */
#define IFX_VADC_ACCPROT0_APC4_OFF (4)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC5 */
#define IFX_VADC_ACCPROT0_APC5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC5 */
#define IFX_VADC_ACCPROT0_APC5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC5 */
#define IFX_VADC_ACCPROT0_APC5_OFF (5)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC6 */
#define IFX_VADC_ACCPROT0_APC6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC6 */
#define IFX_VADC_ACCPROT0_APC6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC6 */
#define IFX_VADC_ACCPROT0_APC6_OFF (6)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC7 */
#define IFX_VADC_ACCPROT0_APC7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC7 */
#define IFX_VADC_ACCPROT0_APC7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC7 */
#define IFX_VADC_ACCPROT0_APC7_OFF (7)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC8 */
#define IFX_VADC_ACCPROT0_APC8_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC8 */
#define IFX_VADC_ACCPROT0_APC8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC8 */
#define IFX_VADC_ACCPROT0_APC8_OFF (8)

