HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC9 */
#define IFX_VADC_ACCPROT0_APC9_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC9 */
#define IFX_VADC_ACCPROT0_APC9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC9 */
#define IFX_VADC_ACCPROT0_APC9_OFF (9)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APEM */
#define IFX_VADC_ACCPROT0_APEM_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APEM */
#define IFX_VADC_ACCPROT0_APEM_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APEM */
#define IFX_VADC_ACCPROT0_APEM_OFF (15)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APGC */
#define IFX_VADC_ACCPROT0_APGC_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APGC */
#define IFX_VADC_ACCPROT0_APGC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APGC */
#define IFX_VADC_ACCPROT0_APGC_OFF (31)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API0 */
#define IFX_VADC_ACCPROT0_API0_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API0 */
#define IFX_VADC_ACCPROT0_API0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API0 */
#define IFX_VADC_ACCPROT0_API0_OFF (16)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API10 */
#define IFX_VADC_ACCPROT0_API10_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API10 */
#define IFX_VADC_ACCPROT0_API10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API10 */
#define IFX_VADC_ACCPROT0_API10_OFF (26)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API1 */
#define IFX_VADC_ACCPROT0_API1_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API1 */
#define IFX_VADC_ACCPROT0_API1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API1 */
#define IFX_VADC_ACCPROT0_API1_OFF (17)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API2 */
#define IFX_VADC_ACCPROT0_API2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API2 */
#define IFX_VADC_ACCPROT0_API2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API2 */
#define IFX_VADC_ACCPROT0_API2_OFF (18)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API3 */
#define IFX_VADC_ACCPROT0_API3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API3 */
#define IFX_VADC_ACCPROT0_API3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API3 */
#define IFX_VADC_ACCPROT0_API3_OFF (19)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API4 */
#define IFX_VADC_ACCPROT0_API4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API4 */
#define IFX_VADC_ACCPROT0_API4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API4 */
#define IFX_VADC_ACCPROT0_API4_OFF (20)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API5 */
#define IFX_VADC_ACCPROT0_API5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API5 */
#define IFX_VADC_ACCPROT0_API5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API5 */
#define IFX_VADC_ACCPROT0_API5_OFF (21)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API6 */
#define IFX_VADC_ACCPROT0_API6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API6 */
#define IFX_VADC_ACCPROT0_API6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API6 */
#define IFX_VADC_ACCPROT0_API6_OFF (22)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API7 */
#define IFX_VADC_ACCPROT0_API7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API7 */
#define IFX_VADC_ACCPROT0_API7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API7 */
#define IFX_VADC_ACCPROT0_API7_OFF (23)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API8 */
#define IFX_VADC_ACCPROT0_API8_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API8 */
#define IFX_VADC_ACCPROT0_API8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API8 */
#define IFX_VADC_ACCPROT0_API8_OFF (24)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API9 */
#define IFX_VADC_ACCPROT0_API9_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API9 */
#define IFX_VADC_ACCPROT0_API9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API9 */
#define IFX_VADC_ACCPROT0_API9_OFF (25)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_OFF (16)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR10 */
#define IFX_VADC_ACCPROT1_APR10_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR10 */
#define IFX_VADC_ACCPROT1_APR10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR10 */
#define IFX_VADC_ACCPROT1_APR10_OFF (26)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_OFF (17)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_OFF (18)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_OFF (19)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_OFF (20)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_OFF (21)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_OFF (22)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_OFF (23)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR8 */
#define IFX_VADC_ACCPROT1_APR8_LEN (1)

