HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_OFF (0)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_OFF (3)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.ENTR */
#define IFX_VADC_BRSMR_ENTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.ENTR */
#define IFX_VADC_BRSMR_ENTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.ENTR */
#define IFX_VADC_BRSMR_ENTR_OFF (2)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.LDEV */
#define IFX_VADC_BRSMR_LDEV_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.LDEV */
#define IFX_VADC_BRSMR_LDEV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.LDEV */
#define IFX_VADC_BRSMR_LDEV_OFF (9)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.LDM */
#define IFX_VADC_BRSMR_LDM_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.LDM */
#define IFX_VADC_BRSMR_LDM_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.LDM */
#define IFX_VADC_BRSMR_LDM_OFF (5)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.REQGT */
#define IFX_VADC_BRSMR_REQGT_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.REQGT */
#define IFX_VADC_BRSMR_REQGT_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.REQGT */
#define IFX_VADC_BRSMR_REQGT_OFF (7)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_OFF (16)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_OFF (4)

/** \\brief  Length for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_LEN (32)

/** \\brief  Mask for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_OFF (0)

/** \\brief  Length for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_LEN (32)

/** \\brief  Mask for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_OFF (0)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BNDSELL */
#define IFX_VADC_CHCTR_BNDSELL_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BNDSELL */
#define IFX_VADC_CHCTR_BNDSELL_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BNDSELL */
#define IFX_VADC_CHCTR_BNDSELL_OFF (4)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BNDSELU */
#define IFX_VADC_CHCTR_BNDSELU_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BNDSELU */
#define IFX_VADC_CHCTR_BNDSELU_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BNDSELU */
#define IFX_VADC_CHCTR_BNDSELU_OFF (6)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BNDSELX */
#define IFX_VADC_CHCTR_BNDSELX_LEN (4)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BNDSELX */
#define IFX_VADC_CHCTR_BNDSELX_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BNDSELX */
#define IFX_VADC_CHCTR_BNDSELX_OFF (12)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BWDCH */
#define IFX_VADC_CHCTR_BWDCH_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BWDCH */
#define IFX_VADC_CHCTR_BWDCH_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BWDCH */
#define IFX_VADC_CHCTR_BWDCH_OFF (28)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BWDEN */
#define IFX_VADC_CHCTR_BWDEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BWDEN */
#define IFX_VADC_CHCTR_BWDEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BWDEN */
#define IFX_VADC_CHCTR_BWDEN_OFF (30)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_CHCTR_CHEVMODE_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_CHCTR_CHEVMODE_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_CHCTR_CHEVMODE_OFF (8)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.ICLSEL */
#define IFX_VADC_CHCTR_ICLSEL_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.ICLSEL */
#define IFX_VADC_CHCTR_ICLSEL_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.ICLSEL */
#define IFX_VADC_CHCTR_ICLSEL_OFF (0)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.REFSEL */
#define IFX_VADC_CHCTR_REFSEL_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.REFSEL */
#define IFX_VADC_CHCTR_REFSEL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.REFSEL */
#define IFX_VADC_CHCTR_REFSEL_OFF (11)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.RESPOS */
#define IFX_VADC_CHCTR_RESPOS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.RESPOS */
#define IFX_VADC_CHCTR_RESPOS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.RESPOS */
#define IFX_VADC_CHCTR_RESPOS_OFF (21)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.RESREG */
#define IFX_VADC_CHCTR_RESREG_LEN (4)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.RESREG */
#define IFX_VADC_CHCTR_RESREG_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.RESREG */
#define IFX_VADC_CHCTR_RESREG_OFF (16)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.RESTBS */
#define IFX_VADC_CHCTR_RESTBS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.RESTBS */
#define IFX_VADC_CHCTR_RESTBS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.RESTBS */
#define IFX_VADC_CHCTR_RESTBS_OFF (20)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.SYNC */
#define IFX_VADC_CHCTR_SYNC_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.SYNC */
#define IFX_VADC_CHCTR_SYNC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.SYNC */
#define IFX_VADC_CHCTR_SYNC_OFF (10)

/** \\brief  Length for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_OFF (0)

