HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.SCAN */
#define IFX_VADC_G_ASMR_SCAN_OFF (4)

/** \\brief  Length for Ifx_VADC_G_ASPND_Bits.CHPND */
#define IFX_VADC_G_ASPND_CHPND_LEN (32)

/** \\brief  Mask for Ifx_VADC_G_ASPND_Bits.CHPND */
#define IFX_VADC_G_ASPND_CHPND_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_G_ASPND_Bits.CHPND */
#define IFX_VADC_G_ASPND_CHPND_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ASSEL_Bits.CHSEL */
#define IFX_VADC_G_ASSEL_CHSEL_LEN (32)

/** \\brief  Mask for Ifx_VADC_G_ASSEL_Bits.CHSEL */
#define IFX_VADC_G_ASSEL_CHSEL_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_G_ASSEL_Bits.CHSEL */
#define IFX_VADC_G_ASSEL_CHSEL_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFA0 */
#define IFX_VADC_G_BFL_BFA0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFA0 */
#define IFX_VADC_G_BFL_BFA0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFA0 */
#define IFX_VADC_G_BFL_BFA0_OFF (8)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFA1 */
#define IFX_VADC_G_BFL_BFA1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFA1 */
#define IFX_VADC_G_BFL_BFA1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFA1 */
#define IFX_VADC_G_BFL_BFA1_OFF (9)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFA2 */
#define IFX_VADC_G_BFL_BFA2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFA2 */
#define IFX_VADC_G_BFL_BFA2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFA2 */
#define IFX_VADC_G_BFL_BFA2_OFF (10)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFA3 */
#define IFX_VADC_G_BFL_BFA3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFA3 */
#define IFX_VADC_G_BFL_BFA3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFA3 */
#define IFX_VADC_G_BFL_BFA3_OFF (11)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFI0 */
#define IFX_VADC_G_BFL_BFI0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFI0 */
#define IFX_VADC_G_BFL_BFI0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFI0 */
#define IFX_VADC_G_BFL_BFI0_OFF (16)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFI1 */
#define IFX_VADC_G_BFL_BFI1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFI1 */
#define IFX_VADC_G_BFL_BFI1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFI1 */
#define IFX_VADC_G_BFL_BFI1_OFF (17)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFI2 */
#define IFX_VADC_G_BFL_BFI2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFI2 */
#define IFX_VADC_G_BFL_BFI2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFI2 */
#define IFX_VADC_G_BFL_BFI2_OFF (18)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFI3 */
#define IFX_VADC_G_BFL_BFI3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFI3 */
#define IFX_VADC_G_BFL_BFI3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFI3 */
#define IFX_VADC_G_BFL_BFI3_OFF (19)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFL0 */
#define IFX_VADC_G_BFL_BFL0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFL0 */
#define IFX_VADC_G_BFL_BFL0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFL0 */
#define IFX_VADC_G_BFL_BFL0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFL1 */
#define IFX_VADC_G_BFL_BFL1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFL1 */
#define IFX_VADC_G_BFL_BFL1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFL1 */
#define IFX_VADC_G_BFL_BFL1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFL2 */
#define IFX_VADC_G_BFL_BFL2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFL2 */
#define IFX_VADC_G_BFL_BFL2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFL2 */
#define IFX_VADC_G_BFL_BFL2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFL3 */
#define IFX_VADC_G_BFL_BFL3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFL3 */
#define IFX_VADC_G_BFL_BFL3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFL3 */
#define IFX_VADC_G_BFL_BFL3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_BFLC_Bits.BFM0 */
#define IFX_VADC_G_BFLC_BFM0_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLC_Bits.BFM0 */
#define IFX_VADC_G_BFLC_BFM0_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLC_Bits.BFM0 */
#define IFX_VADC_G_BFLC_BFM0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BFLC_Bits.BFM1 */
#define IFX_VADC_G_BFLC_BFM1_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLC_Bits.BFM1 */
#define IFX_VADC_G_BFLC_BFM1_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLC_Bits.BFM1 */
#define IFX_VADC_G_BFLC_BFM1_OFF (4)

/** \\brief  Length for Ifx_VADC_G_BFLC_Bits.BFM2 */
#define IFX_VADC_G_BFLC_BFM2_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLC_Bits.BFM2 */
#define IFX_VADC_G_BFLC_BFM2_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLC_Bits.BFM2 */
#define IFX_VADC_G_BFLC_BFM2_OFF (8)

/** \\brief  Length for Ifx_VADC_G_BFLC_Bits.BFM3 */
#define IFX_VADC_G_BFLC_BFM3_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLC_Bits.BFM3 */
#define IFX_VADC_G_BFLC_BFM3_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLC_Bits.BFM3 */
#define IFX_VADC_G_BFLC_BFM3_OFF (12)

/** \\brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL0NP */
#define IFX_VADC_G_BFLNP_BFL0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL0NP */
#define IFX_VADC_G_BFLNP_BFL0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL0NP */
#define IFX_VADC_G_BFLNP_BFL0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL1NP */
#define IFX_VADC_G_BFLNP_BFL1NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL1NP */
#define IFX_VADC_G_BFLNP_BFL1NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL1NP */
#define IFX_VADC_G_BFLNP_BFL1NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL2NP */
#define IFX_VADC_G_BFLNP_BFL2NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL2NP */
#define IFX_VADC_G_BFLNP_BFL2NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL2NP */
#define IFX_VADC_G_BFLNP_BFL2NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL3NP */
#define IFX_VADC_G_BFLNP_BFL3NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL3NP */
#define IFX_VADC_G_BFLNP_BFL3NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL3NP */
#define IFX_VADC_G_BFLNP_BFL3NP_OFF (12)

