HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV3 */
#define IFX_VADC_G_CEFLAG_CEV3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV3 */
#define IFX_VADC_G_CEFLAG_CEV3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV4 */
#define IFX_VADC_G_CEFLAG_CEV4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV4 */
#define IFX_VADC_G_CEFLAG_CEV4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV4 */
#define IFX_VADC_G_CEFLAG_CEV4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV5 */
#define IFX_VADC_G_CEFLAG_CEV5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV5 */
#define IFX_VADC_G_CEFLAG_CEV5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV5 */
#define IFX_VADC_G_CEFLAG_CEV5_OFF (5)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV6 */
#define IFX_VADC_G_CEFLAG_CEV6_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV6 */
#define IFX_VADC_G_CEFLAG_CEV6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV6 */
#define IFX_VADC_G_CEFLAG_CEV6_OFF (6)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV7 */
#define IFX_VADC_G_CEFLAG_CEV7_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV7 */
#define IFX_VADC_G_CEFLAG_CEV7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV7 */
#define IFX_VADC_G_CEFLAG_CEV7_OFF (7)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_VADC_G_CEVNP0_CEV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_VADC_G_CEVNP0_CEV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_VADC_G_CEVNP0_CEV0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_VADC_G_CEVNP0_CEV1NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_VADC_G_CEVNP0_CEV1NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_VADC_G_CEVNP0_CEV1NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_VADC_G_CEVNP0_CEV2NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_VADC_G_CEVNP0_CEV2NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_VADC_G_CEVNP0_CEV2NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_VADC_G_CEVNP0_CEV3NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_VADC_G_CEVNP0_CEV3NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_VADC_G_CEVNP0_CEV3NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_VADC_G_CEVNP0_CEV4NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_VADC_G_CEVNP0_CEV4NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_VADC_G_CEVNP0_CEV4NP_OFF (16)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_VADC_G_CEVNP0_CEV5NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_VADC_G_CEVNP0_CEV5NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_VADC_G_CEVNP0_CEV5NP_OFF (20)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_VADC_G_CEVNP0_CEV6NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_VADC_G_CEVNP0_CEV6NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_VADC_G_CEVNP0_CEV6NP_OFF (24)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_VADC_G_CEVNP0_CEV7NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_VADC_G_CEVNP0_CEV7NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_VADC_G_CEVNP0_CEV7NP_OFF (28)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH0 */
#define IFX_VADC_G_CHASS_ASSCH0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH0 */
#define IFX_VADC_G_CHASS_ASSCH0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH0 */
#define IFX_VADC_G_CHASS_ASSCH0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH10 */
#define IFX_VADC_G_CHASS_ASSCH10_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH10 */
#define IFX_VADC_G_CHASS_ASSCH10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH10 */
#define IFX_VADC_G_CHASS_ASSCH10_OFF (10)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH11 */
#define IFX_VADC_G_CHASS_ASSCH11_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH11 */
#define IFX_VADC_G_CHASS_ASSCH11_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH11 */
#define IFX_VADC_G_CHASS_ASSCH11_OFF (11)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH12 */
#define IFX_VADC_G_CHASS_ASSCH12_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH12 */
#define IFX_VADC_G_CHASS_ASSCH12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH12 */
#define IFX_VADC_G_CHASS_ASSCH12_OFF (12)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH13 */
#define IFX_VADC_G_CHASS_ASSCH13_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH13 */
#define IFX_VADC_G_CHASS_ASSCH13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH13 */
#define IFX_VADC_G_CHASS_ASSCH13_OFF (13)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH14 */
#define IFX_VADC_G_CHASS_ASSCH14_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH14 */
#define IFX_VADC_G_CHASS_ASSCH14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH14 */
#define IFX_VADC_G_CHASS_ASSCH14_OFF (14)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH15 */
#define IFX_VADC_G_CHASS_ASSCH15_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH15 */
#define IFX_VADC_G_CHASS_ASSCH15_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH15 */
#define IFX_VADC_G_CHASS_ASSCH15_OFF (15)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH16 */
#define IFX_VADC_G_CHASS_ASSCH16_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH16 */
#define IFX_VADC_G_CHASS_ASSCH16_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH16 */
#define IFX_VADC_G_CHASS_ASSCH16_OFF (16)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH17 */
#define IFX_VADC_G_CHASS_ASSCH17_LEN (1)

