HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH17 */
#define IFX_VADC_G_CHASS_ASSCH17_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH17 */
#define IFX_VADC_G_CHASS_ASSCH17_OFF (17)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH18 */
#define IFX_VADC_G_CHASS_ASSCH18_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH18 */
#define IFX_VADC_G_CHASS_ASSCH18_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH18 */
#define IFX_VADC_G_CHASS_ASSCH18_OFF (18)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH19 */
#define IFX_VADC_G_CHASS_ASSCH19_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH19 */
#define IFX_VADC_G_CHASS_ASSCH19_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH19 */
#define IFX_VADC_G_CHASS_ASSCH19_OFF (19)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH1 */
#define IFX_VADC_G_CHASS_ASSCH1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH1 */
#define IFX_VADC_G_CHASS_ASSCH1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH1 */
#define IFX_VADC_G_CHASS_ASSCH1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH20 */
#define IFX_VADC_G_CHASS_ASSCH20_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH20 */
#define IFX_VADC_G_CHASS_ASSCH20_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH20 */
#define IFX_VADC_G_CHASS_ASSCH20_OFF (20)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH21 */
#define IFX_VADC_G_CHASS_ASSCH21_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH21 */
#define IFX_VADC_G_CHASS_ASSCH21_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH21 */
#define IFX_VADC_G_CHASS_ASSCH21_OFF (21)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH22 */
#define IFX_VADC_G_CHASS_ASSCH22_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH22 */
#define IFX_VADC_G_CHASS_ASSCH22_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH22 */
#define IFX_VADC_G_CHASS_ASSCH22_OFF (22)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH23 */
#define IFX_VADC_G_CHASS_ASSCH23_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH23 */
#define IFX_VADC_G_CHASS_ASSCH23_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH23 */
#define IFX_VADC_G_CHASS_ASSCH23_OFF (23)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH24 */
#define IFX_VADC_G_CHASS_ASSCH24_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH24 */
#define IFX_VADC_G_CHASS_ASSCH24_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH24 */
#define IFX_VADC_G_CHASS_ASSCH24_OFF (24)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH25 */
#define IFX_VADC_G_CHASS_ASSCH25_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH25 */
#define IFX_VADC_G_CHASS_ASSCH25_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH25 */
#define IFX_VADC_G_CHASS_ASSCH25_OFF (25)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH26 */
#define IFX_VADC_G_CHASS_ASSCH26_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH26 */
#define IFX_VADC_G_CHASS_ASSCH26_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH26 */
#define IFX_VADC_G_CHASS_ASSCH26_OFF (26)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH27 */
#define IFX_VADC_G_CHASS_ASSCH27_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH27 */
#define IFX_VADC_G_CHASS_ASSCH27_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH27 */
#define IFX_VADC_G_CHASS_ASSCH27_OFF (27)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH28 */
#define IFX_VADC_G_CHASS_ASSCH28_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH28 */
#define IFX_VADC_G_CHASS_ASSCH28_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH28 */
#define IFX_VADC_G_CHASS_ASSCH28_OFF (28)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH29 */
#define IFX_VADC_G_CHASS_ASSCH29_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH29 */
#define IFX_VADC_G_CHASS_ASSCH29_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH29 */
#define IFX_VADC_G_CHASS_ASSCH29_OFF (29)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH2 */
#define IFX_VADC_G_CHASS_ASSCH2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH2 */
#define IFX_VADC_G_CHASS_ASSCH2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH2 */
#define IFX_VADC_G_CHASS_ASSCH2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH30 */
#define IFX_VADC_G_CHASS_ASSCH30_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH30 */
#define IFX_VADC_G_CHASS_ASSCH30_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH30 */
#define IFX_VADC_G_CHASS_ASSCH30_OFF (30)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH31 */
#define IFX_VADC_G_CHASS_ASSCH31_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH31 */
#define IFX_VADC_G_CHASS_ASSCH31_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH31 */
#define IFX_VADC_G_CHASS_ASSCH31_OFF (31)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH3 */
#define IFX_VADC_G_CHASS_ASSCH3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH3 */
#define IFX_VADC_G_CHASS_ASSCH3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH3 */
#define IFX_VADC_G_CHASS_ASSCH3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH4 */
#define IFX_VADC_G_CHASS_ASSCH4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH4 */
#define IFX_VADC_G_CHASS_ASSCH4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH4 */
#define IFX_VADC_G_CHASS_ASSCH4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH5 */
#define IFX_VADC_G_CHASS_ASSCH5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH5 */
#define IFX_VADC_G_CHASS_ASSCH5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH5 */
#define IFX_VADC_G_CHASS_ASSCH5_OFF (5)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH6 */
#define IFX_VADC_G_CHASS_ASSCH6_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH6 */
#define IFX_VADC_G_CHASS_ASSCH6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH6 */
#define IFX_VADC_G_CHASS_ASSCH6_OFF (6)

