HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_OFF (16)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_OFF (20)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_OFF (24)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_OFF (28)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR0 */
#define IFX_VADC_G_RRASS_ASSRR0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR0 */
#define IFX_VADC_G_RRASS_ASSRR0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR0 */
#define IFX_VADC_G_RRASS_ASSRR0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR10 */
#define IFX_VADC_G_RRASS_ASSRR10_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR10 */
#define IFX_VADC_G_RRASS_ASSRR10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR10 */
#define IFX_VADC_G_RRASS_ASSRR10_OFF (10)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR11 */
#define IFX_VADC_G_RRASS_ASSRR11_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR11 */
#define IFX_VADC_G_RRASS_ASSRR11_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR11 */
#define IFX_VADC_G_RRASS_ASSRR11_OFF (11)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR12 */
#define IFX_VADC_G_RRASS_ASSRR12_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR12 */
#define IFX_VADC_G_RRASS_ASSRR12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR12 */
#define IFX_VADC_G_RRASS_ASSRR12_OFF (12)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR13 */
#define IFX_VADC_G_RRASS_ASSRR13_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR13 */
#define IFX_VADC_G_RRASS_ASSRR13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR13 */
#define IFX_VADC_G_RRASS_ASSRR13_OFF (13)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR14 */
#define IFX_VADC_G_RRASS_ASSRR14_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR14 */
#define IFX_VADC_G_RRASS_ASSRR14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR14 */
#define IFX_VADC_G_RRASS_ASSRR14_OFF (14)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR15 */
#define IFX_VADC_G_RRASS_ASSRR15_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR15 */
#define IFX_VADC_G_RRASS_ASSRR15_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR15 */
#define IFX_VADC_G_RRASS_ASSRR15_OFF (15)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR1 */
#define IFX_VADC_G_RRASS_ASSRR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR1 */
#define IFX_VADC_G_RRASS_ASSRR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR1 */
#define IFX_VADC_G_RRASS_ASSRR1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR2 */
#define IFX_VADC_G_RRASS_ASSRR2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR2 */
#define IFX_VADC_G_RRASS_ASSRR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR2 */
#define IFX_VADC_G_RRASS_ASSRR2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR3 */
#define IFX_VADC_G_RRASS_ASSRR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR3 */
#define IFX_VADC_G_RRASS_ASSRR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR3 */
#define IFX_VADC_G_RRASS_ASSRR3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR4 */
#define IFX_VADC_G_RRASS_ASSRR4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR4 */
#define IFX_VADC_G_RRASS_ASSRR4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR4 */
#define IFX_VADC_G_RRASS_ASSRR4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR5 */
#define IFX_VADC_G_RRASS_ASSRR5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR5 */
#define IFX_VADC_G_RRASS_ASSRR5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR5 */
#define IFX_VADC_G_RRASS_ASSRR5_OFF (5)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR6 */
#define IFX_VADC_G_RRASS_ASSRR6_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR6 */
#define IFX_VADC_G_RRASS_ASSRR6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR6 */
#define IFX_VADC_G_RRASS_ASSRR6_OFF (6)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR7 */
#define IFX_VADC_G_RRASS_ASSRR7_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR7 */
#define IFX_VADC_G_RRASS_ASSRR7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR7 */
#define IFX_VADC_G_RRASS_ASSRR7_OFF (7)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR8 */
#define IFX_VADC_G_RRASS_ASSRR8_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR8 */
#define IFX_VADC_G_RRASS_ASSRR8_MSK (0x1)

