HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR8 */
#define IFX_VADC_G_RRASS_ASSRR8_OFF (8)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR9 */
#define IFX_VADC_G_RRASS_ASSRR9_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR9 */
#define IFX_VADC_G_RRASS_ASSRR9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR9 */
#define IFX_VADC_G_RRASS_ASSRR9_OFF (9)

/** \\brief  Length for Ifx_VADC_G_SEFCLR_Bits.SEV0 */
#define IFX_VADC_G_SEFCLR_SEV0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SEFCLR_Bits.SEV0 */
#define IFX_VADC_G_SEFCLR_SEV0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SEFCLR_Bits.SEV0 */
#define IFX_VADC_G_SEFCLR_SEV0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_SEFCLR_Bits.SEV1 */
#define IFX_VADC_G_SEFCLR_SEV1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SEFCLR_Bits.SEV1 */
#define IFX_VADC_G_SEFCLR_SEV1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SEFCLR_Bits.SEV1 */
#define IFX_VADC_G_SEFCLR_SEV1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_SEFLAG_Bits.SEV0 */
#define IFX_VADC_G_SEFLAG_SEV0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SEFLAG_Bits.SEV0 */
#define IFX_VADC_G_SEFLAG_SEV0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SEFLAG_Bits.SEV0 */
#define IFX_VADC_G_SEFLAG_SEV0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_SEFLAG_Bits.SEV1 */
#define IFX_VADC_G_SEFLAG_SEV1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SEFLAG_Bits.SEV1 */
#define IFX_VADC_G_SEFLAG_SEV1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SEFLAG_Bits.SEV1 */
#define IFX_VADC_G_SEFLAG_SEV1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_SEVNP_Bits.SEV0NP */
#define IFX_VADC_G_SEVNP_SEV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_SEVNP_Bits.SEV0NP */
#define IFX_VADC_G_SEVNP_SEV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_SEVNP_Bits.SEV0NP */
#define IFX_VADC_G_SEVNP_SEV0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_SEVNP_Bits.SEV1NP */
#define IFX_VADC_G_SEVNP_SEV1NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_SEVNP_Bits.SEV1NP */
#define IFX_VADC_G_SEVNP_SEV1NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_SEVNP_Bits.SEV1NP */
#define IFX_VADC_G_SEVNP_SEV1NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR0 */
#define IFX_VADC_G_SRACT_AGSR0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR0 */
#define IFX_VADC_G_SRACT_AGSR0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR0 */
#define IFX_VADC_G_SRACT_AGSR0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR1 */
#define IFX_VADC_G_SRACT_AGSR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR1 */
#define IFX_VADC_G_SRACT_AGSR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR1 */
#define IFX_VADC_G_SRACT_AGSR1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR2 */
#define IFX_VADC_G_SRACT_AGSR2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR2 */
#define IFX_VADC_G_SRACT_AGSR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR2 */
#define IFX_VADC_G_SRACT_AGSR2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR3 */
#define IFX_VADC_G_SRACT_AGSR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR3 */
#define IFX_VADC_G_SRACT_AGSR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR3 */
#define IFX_VADC_G_SRACT_AGSR3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR0 */
#define IFX_VADC_G_SRACT_ASSR0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR0 */
#define IFX_VADC_G_SRACT_ASSR0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR0 */
#define IFX_VADC_G_SRACT_ASSR0_OFF (8)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR1 */
#define IFX_VADC_G_SRACT_ASSR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR1 */
#define IFX_VADC_G_SRACT_ASSR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR1 */
#define IFX_VADC_G_SRACT_ASSR1_OFF (9)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR2 */
#define IFX_VADC_G_SRACT_ASSR2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR2 */
#define IFX_VADC_G_SRACT_ASSR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR2 */
#define IFX_VADC_G_SRACT_ASSR2_OFF (10)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR3 */
#define IFX_VADC_G_SRACT_ASSR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR3 */
#define IFX_VADC_G_SRACT_ASSR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR3 */
#define IFX_VADC_G_SRACT_ASSR3_OFF (11)

/** \\brief  Length for Ifx_VADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_VADC_G_SYNCTR_EVALR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_VADC_G_SYNCTR_EVALR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_VADC_G_SYNCTR_EVALR1_OFF (4)

/** \\brief  Length for Ifx_VADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_VADC_G_SYNCTR_EVALR2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_VADC_G_SYNCTR_EVALR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_VADC_G_SYNCTR_EVALR2_OFF (5)

/** \\brief  Length for Ifx_VADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_VADC_G_SYNCTR_EVALR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_VADC_G_SYNCTR_EVALR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_VADC_G_SYNCTR_EVALR3_OFF (6)

/** \\brief  Length for Ifx_VADC_G_SYNCTR_Bits.STSEL */
#define IFX_VADC_G_SYNCTR_STSEL_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_SYNCTR_Bits.STSEL */
#define IFX_VADC_G_SYNCTR_STSEL_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_SYNCTR_Bits.STSEL */
#define IFX_VADC_G_SYNCTR_STSEL_OFF (0)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF0 */
#define IFX_VADC_G_VFR_VF0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF0 */
#define IFX_VADC_G_VFR_VF0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF0 */
#define IFX_VADC_G_VFR_VF0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF10 */
#define IFX_VADC_G_VFR_VF10_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF10 */
#define IFX_VADC_G_VFR_VF10_MSK (0x1)

