HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL1 */
#define IFX_VADC_GLOBCFG_DPCAL1_OFF (17)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL2 */
#define IFX_VADC_GLOBCFG_DPCAL2_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL2 */
#define IFX_VADC_GLOBCFG_DPCAL2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL2 */
#define IFX_VADC_GLOBCFG_DPCAL2_OFF (18)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL3 */
#define IFX_VADC_GLOBCFG_DPCAL3_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL3 */
#define IFX_VADC_GLOBCFG_DPCAL3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL3 */
#define IFX_VADC_GLOBCFG_DPCAL3_OFF (19)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL4 */
#define IFX_VADC_GLOBCFG_DPCAL4_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL4 */
#define IFX_VADC_GLOBCFG_DPCAL4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL4 */
#define IFX_VADC_GLOBCFG_DPCAL4_OFF (20)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL5 */
#define IFX_VADC_GLOBCFG_DPCAL5_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL5 */
#define IFX_VADC_GLOBCFG_DPCAL5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL5 */
#define IFX_VADC_GLOBCFG_DPCAL5_OFF (21)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL6 */
#define IFX_VADC_GLOBCFG_DPCAL6_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL6 */
#define IFX_VADC_GLOBCFG_DPCAL6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL6 */
#define IFX_VADC_GLOBCFG_DPCAL6_OFF (22)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL7 */
#define IFX_VADC_GLOBCFG_DPCAL7_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL7 */
#define IFX_VADC_GLOBCFG_DPCAL7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL7 */
#define IFX_VADC_GLOBCFG_DPCAL7_OFF (23)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL8 */
#define IFX_VADC_GLOBCFG_DPCAL8_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL8 */
#define IFX_VADC_GLOBCFG_DPCAL8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL8 */
#define IFX_VADC_GLOBCFG_DPCAL8_OFF (24)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL9 */
#define IFX_VADC_GLOBCFG_DPCAL9_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL9 */
#define IFX_VADC_GLOBCFG_DPCAL9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL9 */
#define IFX_VADC_GLOBCFG_DPCAL9_OFF (25)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.SUCAL */
#define IFX_VADC_GLOBCFG_SUCAL_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.SUCAL */
#define IFX_VADC_GLOBCFG_SUCAL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.SUCAL */
#define IFX_VADC_GLOBCFG_SUCAL_OFF (31)

/** \\brief  Length for Ifx_VADC_GLOBEFLAG_Bits.REVGLB */
#define IFX_VADC_GLOBEFLAG_REVGLB_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.REVGLB */
#define IFX_VADC_GLOBEFLAG_REVGLB_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.REVGLB */
#define IFX_VADC_GLOBEFLAG_REVGLB_OFF (8)

/** \\brief  Length for Ifx_VADC_GLOBEFLAG_Bits.REVGLBCLR */
#define IFX_VADC_GLOBEFLAG_REVGLBCLR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.REVGLBCLR */
#define IFX_VADC_GLOBEFLAG_REVGLBCLR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.REVGLBCLR */
#define IFX_VADC_GLOBEFLAG_REVGLBCLR_OFF (24)

/** \\brief  Length for Ifx_VADC_GLOBEFLAG_Bits.SEVGLB */
#define IFX_VADC_GLOBEFLAG_SEVGLB_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.SEVGLB */
#define IFX_VADC_GLOBEFLAG_SEVGLB_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.SEVGLB */
#define IFX_VADC_GLOBEFLAG_SEVGLB_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBEFLAG_Bits.SEVGLBCLR */
#define IFX_VADC_GLOBEFLAG_SEVGLBCLR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.SEVGLBCLR */
#define IFX_VADC_GLOBEFLAG_SEVGLBCLR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.SEVGLBCLR */
#define IFX_VADC_GLOBEFLAG_SEVGLBCLR_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBEVNP_Bits.REV0NP */
#define IFX_VADC_GLOBEVNP_REV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBEVNP_Bits.REV0NP */
#define IFX_VADC_GLOBEVNP_REV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBEVNP_Bits.REV0NP */
#define IFX_VADC_GLOBEVNP_REV0NP_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBEVNP_Bits.SEV0NP */
#define IFX_VADC_GLOBEVNP_SEV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBEVNP_Bits.SEV0NP */
#define IFX_VADC_GLOBEVNP_SEV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBEVNP_Bits.SEV0NP */
#define IFX_VADC_GLOBEVNP_SEV0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBRCR_Bits.DRCTR */
#define IFX_VADC_GLOBRCR_DRCTR_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBRCR_Bits.DRCTR */
#define IFX_VADC_GLOBRCR_DRCTR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBRCR_Bits.DRCTR */
#define IFX_VADC_GLOBRCR_DRCTR_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBRCR_Bits.SRGEN */
#define IFX_VADC_GLOBRCR_SRGEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRCR_Bits.SRGEN */
#define IFX_VADC_GLOBRCR_SRGEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRCR_Bits.SRGEN */
#define IFX_VADC_GLOBRCR_SRGEN_OFF (31)

/** \\brief  Length for Ifx_VADC_GLOBRCR_Bits.WFR */
#define IFX_VADC_GLOBRCR_WFR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRCR_Bits.WFR */
#define IFX_VADC_GLOBRCR_WFR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRCR_Bits.WFR */
#define IFX_VADC_GLOBRCR_WFR_OFF (24)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.CHNR */
#define IFX_VADC_GLOBRES_CHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.CHNR */
#define IFX_VADC_GLOBRES_CHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.CHNR */
#define IFX_VADC_GLOBRES_CHNR_OFF (20)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.CRS */
#define IFX_VADC_GLOBRES_CRS_LEN (2)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.CRS */
#define IFX_VADC_GLOBRES_CRS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.CRS */
#define IFX_VADC_GLOBRES_CRS_OFF (28)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.EMUX */
#define IFX_VADC_GLOBRES_EMUX_LEN (3)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.EMUX */
#define IFX_VADC_GLOBRES_EMUX_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.EMUX */
#define IFX_VADC_GLOBRES_EMUX_OFF (25)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.FCR */
#define IFX_VADC_GLOBRES_FCR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.FCR */
#define IFX_VADC_GLOBRES_FCR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.FCR */
#define IFX_VADC_GLOBRES_FCR_OFF (30)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.GNR */
#define IFX_VADC_GLOBRES_GNR_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.GNR */
#define IFX_VADC_GLOBRES_GNR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.GNR */
#define IFX_VADC_GLOBRES_GNR_OFF (16)

