HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.RESULT */
#define IFX_VADC_GLOBRES_RESULT_LEN (16)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.RESULT */
#define IFX_VADC_GLOBRES_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.RESULT */
#define IFX_VADC_GLOBRES_RESULT_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.VF */
#define IFX_VADC_GLOBRES_VF_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.VF */
#define IFX_VADC_GLOBRES_VF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.VF */
#define IFX_VADC_GLOBRES_VF_OFF (31)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.CHNR */
#define IFX_VADC_GLOBRESD_CHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.CHNR */
#define IFX_VADC_GLOBRESD_CHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.CHNR */
#define IFX_VADC_GLOBRESD_CHNR_OFF (20)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.CRS */
#define IFX_VADC_GLOBRESD_CRS_LEN (2)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.CRS */
#define IFX_VADC_GLOBRESD_CRS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.CRS */
#define IFX_VADC_GLOBRESD_CRS_OFF (28)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.EMUX */
#define IFX_VADC_GLOBRESD_EMUX_LEN (3)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.EMUX */
#define IFX_VADC_GLOBRESD_EMUX_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.EMUX */
#define IFX_VADC_GLOBRESD_EMUX_OFF (25)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.FCR */
#define IFX_VADC_GLOBRESD_FCR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.FCR */
#define IFX_VADC_GLOBRESD_FCR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.FCR */
#define IFX_VADC_GLOBRESD_FCR_OFF (30)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.GNR */
#define IFX_VADC_GLOBRESD_GNR_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.GNR */
#define IFX_VADC_GLOBRESD_GNR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.GNR */
#define IFX_VADC_GLOBRESD_GNR_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.RESULT */
#define IFX_VADC_GLOBRESD_RESULT_LEN (16)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.RESULT */
#define IFX_VADC_GLOBRESD_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.RESULT */
#define IFX_VADC_GLOBRESD_RESULT_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.VF */
#define IFX_VADC_GLOBRESD_VF_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.VF */
#define IFX_VADC_GLOBRESD_VF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.VF */
#define IFX_VADC_GLOBRESD_VF_OFF (31)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDCH */
#define IFX_VADC_GLOBTF_CDCH_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDCH */
#define IFX_VADC_GLOBTF_CDCH_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDCH */
#define IFX_VADC_GLOBTF_CDCH_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDEN */
#define IFX_VADC_GLOBTF_CDEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDEN */
#define IFX_VADC_GLOBTF_CDEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDEN */
#define IFX_VADC_GLOBTF_CDEN_OFF (8)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDGR */
#define IFX_VADC_GLOBTF_CDGR_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDGR */
#define IFX_VADC_GLOBTF_CDGR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDGR */
#define IFX_VADC_GLOBTF_CDGR_OFF (4)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDSEL */
#define IFX_VADC_GLOBTF_CDSEL_LEN (2)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDSEL */
#define IFX_VADC_GLOBTF_CDSEL_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDSEL */
#define IFX_VADC_GLOBTF_CDSEL_OFF (9)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDWC */
#define IFX_VADC_GLOBTF_CDWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDWC */
#define IFX_VADC_GLOBTF_CDWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDWC */
#define IFX_VADC_GLOBTF_CDWC_OFF (15)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.MDPD */
#define IFX_VADC_GLOBTF_MDPD_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.MDPD */
#define IFX_VADC_GLOBTF_MDPD_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.MDPD */
#define IFX_VADC_GLOBTF_MDPD_OFF (17)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.MDPU */
#define IFX_VADC_GLOBTF_MDPU_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.MDPU */
#define IFX_VADC_GLOBTF_MDPU_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.MDPU */
#define IFX_VADC_GLOBTF_MDPU_OFF (18)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.MDWC */
#define IFX_VADC_GLOBTF_MDWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.MDWC */
#define IFX_VADC_GLOBTF_MDWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.MDWC */
#define IFX_VADC_GLOBTF_MDWC_OFF (23)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.PDD */
#define IFX_VADC_GLOBTF_PDD_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.PDD */
#define IFX_VADC_GLOBTF_PDD_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.PDD */
#define IFX_VADC_GLOBTF_PDD_OFF (16)

/** \\brief  Length for Ifx_VADC_ICLASS_Bits.CME */
#define IFX_VADC_ICLASS_CME_LEN (3)

/** \\brief  Mask for Ifx_VADC_ICLASS_Bits.CME */
#define IFX_VADC_ICLASS_CME_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_ICLASS_Bits.CME */
#define IFX_VADC_ICLASS_CME_OFF (24)

/** \\brief  Length for Ifx_VADC_ICLASS_Bits.CMS */
#define IFX_VADC_ICLASS_CMS_LEN (3)

/** \\brief  Mask for Ifx_VADC_ICLASS_Bits.CMS */
#define IFX_VADC_ICLASS_CMS_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_ICLASS_Bits.CMS */
#define IFX_VADC_ICLASS_CMS_OFF (8)

/** \\brief  Length for Ifx_VADC_ICLASS_Bits.STCE */
#define IFX_VADC_ICLASS_STCE_LEN (5)

/** \\brief  Mask for Ifx_VADC_ICLASS_Bits.STCE */
#define IFX_VADC_ICLASS_STCE_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_ICLASS_Bits.STCE */
#define IFX_VADC_ICLASS_STCE_OFF (16)

/** \\brief  Length for Ifx_VADC_ICLASS_Bits.STCS */
#define IFX_VADC_ICLASS_STCS_LEN (5)

/** \\brief  Mask for Ifx_VADC_ICLASS_Bits.STCS */
#define IFX_VADC_ICLASS_STCS_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_ICLASS_Bits.STCS */
#define IFX_VADC_ICLASS_STCS_OFF (0)

