HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_ID_Bits.MOD_REV */
#define IFX_VADC_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_VADC_ID_Bits.MOD_REV */
#define IFX_VADC_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_ID_Bits.MOD_REV */
#define IFX_VADC_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_VADC_ID_Bits.MOD_TYPE */
#define IFX_VADC_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_VADC_ID_Bits.MOD_TYPE */
#define IFX_VADC_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_ID_Bits.MOD_TYPE */
#define IFX_VADC_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_VADC_ID_Bits.MODNUMBER */
#define IFX_VADC_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_VADC_ID_Bits.MODNUMBER */
#define IFX_VADC_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_ID_Bits.MODNUMBER */
#define IFX_VADC_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_VADC_KRST0_Bits.RST */
#define IFX_VADC_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_VADC_KRST0_Bits.RST */
#define IFX_VADC_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_KRST0_Bits.RST */
#define IFX_VADC_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_VADC_KRST0_Bits.RSTSTAT */
#define IFX_VADC_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_VADC_KRST0_Bits.RSTSTAT */
#define IFX_VADC_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_KRST0_Bits.RSTSTAT */
#define IFX_VADC_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_VADC_KRST1_Bits.RST */
#define IFX_VADC_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_VADC_KRST1_Bits.RST */
#define IFX_VADC_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_KRST1_Bits.RST */
#define IFX_VADC_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_VADC_KRSTCLR_Bits.CLR */
#define IFX_VADC_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_VADC_KRSTCLR_Bits.CLR */
#define IFX_VADC_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_KRSTCLR_Bits.CLR */
#define IFX_VADC_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_VADC_OCS_Bits.SUS */
#define IFX_VADC_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.SUS */
#define IFX_VADC_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.SUS */
#define IFX_VADC_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_VADC_OCS_Bits.SUS_P */
#define IFX_VADC_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.SUS_P */
#define IFX_VADC_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.SUS_P */
#define IFX_VADC_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_VADC_OCS_Bits.SUSSTA */
#define IFX_VADC_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.SUSSTA */
#define IFX_VADC_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.SUSSTA */
#define IFX_VADC_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_VADC_OCS_Bits.TG_P */
#define IFX_VADC_OCS_TG_P_LEN (1)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.TG_P */
#define IFX_VADC_OCS_TG_P_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.TG_P */
#define IFX_VADC_OCS_TG_P_OFF (3)

/** \\brief  Length for Ifx_VADC_OCS_Bits.TGB */
#define IFX_VADC_OCS_TGB_LEN (1)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.TGB */
#define IFX_VADC_OCS_TGB_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.TGB */
#define IFX_VADC_OCS_TGB_OFF (2)

/** \\brief  Length for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_LEN (2)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_OFF (0)

/** \\brief  Length for Ifx_VADC_RCR_Bits.DMM */
#define IFX_VADC_RCR_DMM_LEN (2)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.DMM */
#define IFX_VADC_RCR_DMM_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.DMM */
#define IFX_VADC_RCR_DMM_OFF (20)

/** \\brief  Length for Ifx_VADC_RCR_Bits.DRCTR */
#define IFX_VADC_RCR_DRCTR_LEN (4)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.DRCTR */
#define IFX_VADC_RCR_DRCTR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.DRCTR */
#define IFX_VADC_RCR_DRCTR_OFF (16)

/** \\brief  Length for Ifx_VADC_RCR_Bits.FEN */
#define IFX_VADC_RCR_FEN_LEN (2)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.FEN */
#define IFX_VADC_RCR_FEN_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.FEN */
#define IFX_VADC_RCR_FEN_OFF (25)

/** \\brief  Length for Ifx_VADC_RCR_Bits.SRGEN */
#define IFX_VADC_RCR_SRGEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.SRGEN */
#define IFX_VADC_RCR_SRGEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.SRGEN */
#define IFX_VADC_RCR_SRGEN_OFF (31)

/** \\brief  Length for Ifx_VADC_RCR_Bits.WFR */
#define IFX_VADC_RCR_WFR_LEN (1)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.WFR */
#define IFX_VADC_RCR_WFR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.WFR */
#define IFX_VADC_RCR_WFR_OFF (24)

/** \\brief  Length for Ifx_VADC_RES_Bits.CHNR */
#define IFX_VADC_RES_CHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_RES_Bits.CHNR */
#define IFX_VADC_RES_CHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_RES_Bits.CHNR */
#define IFX_VADC_RES_CHNR_OFF (20)

/** \\brief  Length for Ifx_VADC_RES_Bits.CRS */
#define IFX_VADC_RES_CRS_LEN (2)

/** \\brief  Mask for Ifx_VADC_RES_Bits.CRS */
#define IFX_VADC_RES_CRS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_RES_Bits.CRS */
#define IFX_VADC_RES_CRS_OFF (28)

/** \\brief  Length for Ifx_VADC_RES_Bits.DRC */
#define IFX_VADC_RES_DRC_LEN (4)

/** \\brief  Mask for Ifx_VADC_RES_Bits.DRC */
#define IFX_VADC_RES_DRC_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_RES_Bits.DRC */
#define IFX_VADC_RES_DRC_OFF (16)

/** \\brief  Length for Ifx_VADC_RES_Bits.EMUX */
#define IFX_VADC_RES_EMUX_LEN (3)

/** \\brief  Mask for Ifx_VADC_RES_Bits.EMUX */
#define IFX_VADC_RES_EMUX_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_RES_Bits.EMUX */
#define IFX_VADC_RES_EMUX_OFF (25)

/** \\brief  Length for Ifx_VADC_RES_Bits.FCR */
#define IFX_VADC_RES_FCR_LEN (1)

/** \\brief  Mask for Ifx_VADC_RES_Bits.FCR */
#define IFX_VADC_RES_FCR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RES_Bits.FCR */
#define IFX_VADC_RES_FCR_OFF (30)

/** \\brief  Length for Ifx_VADC_RES_Bits.RESULT */
#define IFX_VADC_RES_RESULT_LEN (16)

