HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_SHS2_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS2_SHSCFG_SCWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS2_SHSCFG_SCWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS2_SHSCFG_SCWC_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS2_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS2_SHSCFG_SP0_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS2_SHSCFG_SP0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS2_SHSCFG_SP0_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS2_SHSCFG_Bits.SP1 */
#define IFX_VADC_SHS2_SHSCFG_SP1_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_SHSCFG_Bits.SP1 */
#define IFX_VADC_SHS2_SHSCFG_SP1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_SHSCFG_Bits.SP1 */
#define IFX_VADC_SHS2_SHSCFG_SP1_OFF (17)

/** \\brief  Length for Ifx_VADC_SHS2_SHSCFG_Bits.SP2 */
#define IFX_VADC_SHS2_SHSCFG_SP2_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_SHSCFG_Bits.SP2 */
#define IFX_VADC_SHS2_SHSCFG_SP2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_SHSCFG_Bits.SP2 */
#define IFX_VADC_SHS2_SHSCFG_SP2_OFF (18)

/** \\brief  Length for Ifx_VADC_SHS2_SHSCFG_Bits.SP3 */
#define IFX_VADC_SHS2_SHSCFG_SP3_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_SHSCFG_Bits.SP3 */
#define IFX_VADC_SHS2_SHSCFG_SP3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_SHSCFG_Bits.SP3 */
#define IFX_VADC_SHS2_SHSCFG_SP3_OFF (19)

/** \\brief  Length for Ifx_VADC_SHS2_SHSCFG_Bits.STATE */
#define IFX_VADC_SHS2_SHSCFG_STATE_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS2_SHSCFG_Bits.STATE */
#define IFX_VADC_SHS2_SHSCFG_STATE_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS2_SHSCFG_Bits.STATE */
#define IFX_VADC_SHS2_SHSCFG_STATE_OFF (28)

/** \\brief  Length for Ifx_VADC_SHS2_SHSCFG_Bits.SYNSH01 */
#define IFX_VADC_SHS2_SHSCFG_SYNSH01_LEN (2)

/** \\brief  Mask for Ifx_VADC_SHS2_SHSCFG_Bits.SYNSH01 */
#define IFX_VADC_SHS2_SHSCFG_SYNSH01_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_SHS2_SHSCFG_Bits.SYNSH01 */
#define IFX_VADC_SHS2_SHSCFG_SYNSH01_OFF (7)

/** \\brief  Length for Ifx_VADC_SHS2_SHSCFG_Bits.SYNSH23 */
#define IFX_VADC_SHS2_SHSCFG_SYNSH23_LEN (2)

/** \\brief  Mask for Ifx_VADC_SHS2_SHSCFG_Bits.SYNSH23 */
#define IFX_VADC_SHS2_SHSCFG_SYNSH23_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_SHS2_SHSCFG_Bits.SYNSH23 */
#define IFX_VADC_SHS2_SHSCFG_SYNSH23_OFF (5)

/** \\brief  Length for Ifx_VADC_SHS2_SHSCFG_Bits.TC */
#define IFX_VADC_SHS2_SHSCFG_TC_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS2_SHSCFG_Bits.TC */
#define IFX_VADC_SHS2_SHSCFG_TC_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS2_SHSCFG_Bits.TC */
#define IFX_VADC_SHS2_SHSCFG_TC_OFF (24)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL0 */
#define IFX_VADC_SHS2_STEPCFG_KSEL0_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL0 */
#define IFX_VADC_SHS2_STEPCFG_KSEL0_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL0 */
#define IFX_VADC_SHS2_STEPCFG_KSEL0_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL1 */
#define IFX_VADC_SHS2_STEPCFG_KSEL1_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL1 */
#define IFX_VADC_SHS2_STEPCFG_KSEL1_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL1 */
#define IFX_VADC_SHS2_STEPCFG_KSEL1_OFF (4)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL2 */
#define IFX_VADC_SHS2_STEPCFG_KSEL2_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL2 */
#define IFX_VADC_SHS2_STEPCFG_KSEL2_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL2 */
#define IFX_VADC_SHS2_STEPCFG_KSEL2_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL3 */
#define IFX_VADC_SHS2_STEPCFG_KSEL3_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL3 */
#define IFX_VADC_SHS2_STEPCFG_KSEL3_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL3 */
#define IFX_VADC_SHS2_STEPCFG_KSEL3_OFF (12)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL4 */
#define IFX_VADC_SHS2_STEPCFG_KSEL4_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL4 */
#define IFX_VADC_SHS2_STEPCFG_KSEL4_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL4 */
#define IFX_VADC_SHS2_STEPCFG_KSEL4_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL5 */
#define IFX_VADC_SHS2_STEPCFG_KSEL5_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL5 */
#define IFX_VADC_SHS2_STEPCFG_KSEL5_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL5 */
#define IFX_VADC_SHS2_STEPCFG_KSEL5_OFF (20)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL6 */
#define IFX_VADC_SHS2_STEPCFG_KSEL6_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL6 */
#define IFX_VADC_SHS2_STEPCFG_KSEL6_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL6 */
#define IFX_VADC_SHS2_STEPCFG_KSEL6_OFF (24)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL7 */
#define IFX_VADC_SHS2_STEPCFG_KSEL7_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL7 */
#define IFX_VADC_SHS2_STEPCFG_KSEL7_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.KSEL7 */
#define IFX_VADC_SHS2_STEPCFG_KSEL7_OFF (28)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.SEN0 */
#define IFX_VADC_SHS2_STEPCFG_SEN0_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.SEN0 */
#define IFX_VADC_SHS2_STEPCFG_SEN0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.SEN0 */
#define IFX_VADC_SHS2_STEPCFG_SEN0_OFF (3)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.SEN1 */
#define IFX_VADC_SHS2_STEPCFG_SEN1_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.SEN1 */
#define IFX_VADC_SHS2_STEPCFG_SEN1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.SEN1 */
#define IFX_VADC_SHS2_STEPCFG_SEN1_OFF (7)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.SEN2 */
#define IFX_VADC_SHS2_STEPCFG_SEN2_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.SEN2 */
#define IFX_VADC_SHS2_STEPCFG_SEN2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.SEN2 */
#define IFX_VADC_SHS2_STEPCFG_SEN2_OFF (11)

