HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.SEN3 */
#define IFX_VADC_SHS2_STEPCFG_SEN3_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.SEN3 */
#define IFX_VADC_SHS2_STEPCFG_SEN3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.SEN3 */
#define IFX_VADC_SHS2_STEPCFG_SEN3_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.SEN4 */
#define IFX_VADC_SHS2_STEPCFG_SEN4_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.SEN4 */
#define IFX_VADC_SHS2_STEPCFG_SEN4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.SEN4 */
#define IFX_VADC_SHS2_STEPCFG_SEN4_OFF (19)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.SEN5 */
#define IFX_VADC_SHS2_STEPCFG_SEN5_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.SEN5 */
#define IFX_VADC_SHS2_STEPCFG_SEN5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.SEN5 */
#define IFX_VADC_SHS2_STEPCFG_SEN5_OFF (23)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.SEN6 */
#define IFX_VADC_SHS2_STEPCFG_SEN6_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.SEN6 */
#define IFX_VADC_SHS2_STEPCFG_SEN6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.SEN6 */
#define IFX_VADC_SHS2_STEPCFG_SEN6_OFF (27)

/** \\brief  Length for Ifx_VADC_SHS2_STEPCFG_Bits.SEN7 */
#define IFX_VADC_SHS2_STEPCFG_SEN7_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS2_STEPCFG_Bits.SEN7 */
#define IFX_VADC_SHS2_STEPCFG_SEN7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS2_STEPCFG_Bits.SEN7 */
#define IFX_VADC_SHS2_STEPCFG_SEN7_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.ARCDIS */
#define IFX_VADC_SHS_CALCTR_ARCDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.ARCDIS */
#define IFX_VADC_SHS_CALCTR_ARCDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.ARCDIS */
#define IFX_VADC_SHS_CALCTR_ARCDIS_OFF (2)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.ARCH */
#define IFX_VADC_SHS_CALCTR_ARCH_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.ARCH */
#define IFX_VADC_SHS_CALCTR_ARCH_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.ARCH */
#define IFX_VADC_SHS_CALCTR_ARCH_OFF (3)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.AREFDEF */
#define IFX_VADC_SHS_CALCTR_AREFDEF_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.AREFDEF */
#define IFX_VADC_SHS_CALCTR_AREFDEF_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.AREFDEF */
#define IFX_VADC_SHS_CALCTR_AREFDEF_OFF (4)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.ARM */
#define IFX_VADC_SHS_CALCTR_ARM_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.ARM */
#define IFX_VADC_SHS_CALCTR_ARM_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.ARM */
#define IFX_VADC_SHS_CALCTR_ARM_OFF (7)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.CALGNSTC */
#define IFX_VADC_SHS_CALCTR_CALGNSTC_LEN (6)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.CALGNSTC */
#define IFX_VADC_SHS_CALCTR_CALGNSTC_MSK (0x3f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.CALGNSTC */
#define IFX_VADC_SHS_CALCTR_CALGNSTC_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.CALMAX */
#define IFX_VADC_SHS_CALCTR_CALMAX_LEN (6)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.CALMAX */
#define IFX_VADC_SHS_CALCTR_CALMAX_MSK (0x3f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.CALMAX */
#define IFX_VADC_SHS_CALCTR_CALMAX_OFF (24)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.CALORD */
#define IFX_VADC_SHS_CALCTR_CALORD_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.CALORD */
#define IFX_VADC_SHS_CALCTR_CALORD_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.CALORD */
#define IFX_VADC_SHS_CALCTR_CALORD_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_LEN (7)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_MSK (0x7f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS_CALOC_Bits.CALOFFVAL0 */
#define IFX_VADC_SHS_CALOC_CALOFFVAL0_LEN (7)

/** \\brief  Mask for Ifx_VADC_SHS_CALOC_Bits.CALOFFVAL0 */
#define IFX_VADC_SHS_CALOC_CALOFFVAL0_MSK (0x7f)

/** \\brief  Offset for Ifx_VADC_SHS_CALOC_Bits.CALOFFVAL0 */
#define IFX_VADC_SHS_CALOC_CALOFFVAL0_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_CALOC_Bits.DISCAL */
#define IFX_VADC_SHS_CALOC_DISCAL_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALOC_Bits.DISCAL */
#define IFX_VADC_SHS_CALOC_DISCAL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALOC_Bits.DISCAL */
#define IFX_VADC_SHS_CALOC_DISCAL_OFF (31)

