HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_SHS_CALOC_Bits.OFFWC */
#define IFX_VADC_SHS_CALOC_OFFWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALOC_Bits.OFFWC */
#define IFX_VADC_SHS_CALOC_OFFWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALOC_Bits.OFFWC */
#define IFX_VADC_SHS_CALOC_OFFWC_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS_ID_Bits.MOD_REV */
#define IFX_VADC_SHS_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_VADC_SHS_ID_Bits.MOD_REV */
#define IFX_VADC_SHS_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_SHS_ID_Bits.MOD_REV */
#define IFX_VADC_SHS_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_ID_Bits.MOD_TYPE */
#define IFX_VADC_SHS_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_VADC_SHS_ID_Bits.MOD_TYPE */
#define IFX_VADC_SHS_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_SHS_ID_Bits.MOD_TYPE */
#define IFX_VADC_SHS_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS_ID_Bits.MODNUMBER */
#define IFX_VADC_SHS_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_VADC_SHS_ID_Bits.MODNUMBER */
#define IFX_VADC_SHS_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_SHS_ID_Bits.MODNUMBER */
#define IFX_VADC_SHS_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.ANOFF */
#define IFX_VADC_SHS_SHSCFG_ANOFF_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.ANOFF */
#define IFX_VADC_SHS_SHSCFG_ANOFF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.ANOFF */
#define IFX_VADC_SHS_SHSCFG_ANOFF_OFF (12)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.ANRDY */
#define IFX_VADC_SHS_SHSCFG_ANRDY_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.ANRDY */
#define IFX_VADC_SHS_SHSCFG_ANRDY_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.ANRDY */
#define IFX_VADC_SHS_SHSCFG_ANRDY_OFF (14)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.AREF */
#define IFX_VADC_SHS_SHSCFG_AREF_LEN (2)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.AREF */
#define IFX_VADC_SHS_SHSCFG_AREF_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.AREF */
#define IFX_VADC_SHS_SHSCFG_AREF_OFF (10)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.DIVS */
#define IFX_VADC_SHS_SHSCFG_DIVS_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.DIVS */
#define IFX_VADC_SHS_SHSCFG_DIVS_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.DIVS */
#define IFX_VADC_SHS_SHSCFG_DIVS_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS_SHSCFG_SCWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS_SHSCFG_SCWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS_SHSCFG_SCWC_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS_SHSCFG_SP0_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS_SHSCFG_SP0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS_SHSCFG_SP0_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SP1 */
#define IFX_VADC_SHS_SHSCFG_SP1_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SP1 */
#define IFX_VADC_SHS_SHSCFG_SP1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SP1 */
#define IFX_VADC_SHS_SHSCFG_SP1_OFF (17)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SP2 */
#define IFX_VADC_SHS_SHSCFG_SP2_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SP2 */
#define IFX_VADC_SHS_SHSCFG_SP2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SP2 */
#define IFX_VADC_SHS_SHSCFG_SP2_OFF (18)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SP3 */
#define IFX_VADC_SHS_SHSCFG_SP3_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SP3 */
#define IFX_VADC_SHS_SHSCFG_SP3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SP3 */
#define IFX_VADC_SHS_SHSCFG_SP3_OFF (19)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.STATE */
#define IFX_VADC_SHS_SHSCFG_STATE_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.STATE */
#define IFX_VADC_SHS_SHSCFG_STATE_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.STATE */
#define IFX_VADC_SHS_SHSCFG_STATE_OFF (28)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SYNSH01 */
#define IFX_VADC_SHS_SHSCFG_SYNSH01_LEN (2)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SYNSH01 */
#define IFX_VADC_SHS_SHSCFG_SYNSH01_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SYNSH01 */
#define IFX_VADC_SHS_SHSCFG_SYNSH01_OFF (7)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SYNSH23 */
#define IFX_VADC_SHS_SHSCFG_SYNSH23_LEN (2)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SYNSH23 */
#define IFX_VADC_SHS_SHSCFG_SYNSH23_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SYNSH23 */
#define IFX_VADC_SHS_SHSCFG_SYNSH23_OFF (5)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.TC */
#define IFX_VADC_SHS_SHSCFG_TC_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.TC */
#define IFX_VADC_SHS_SHSCFG_TC_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.TC */
#define IFX_VADC_SHS_SHSCFG_TC_OFF (24)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL0 */
#define IFX_VADC_SHS_STEPCFG_KSEL0_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL0 */
#define IFX_VADC_SHS_STEPCFG_KSEL0_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL0 */
#define IFX_VADC_SHS_STEPCFG_KSEL0_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL1 */
#define IFX_VADC_SHS_STEPCFG_KSEL1_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL1 */
#define IFX_VADC_SHS_STEPCFG_KSEL1_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL1 */
#define IFX_VADC_SHS_STEPCFG_KSEL1_OFF (4)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL2 */
#define IFX_VADC_SHS_STEPCFG_KSEL2_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL2 */
#define IFX_VADC_SHS_STEPCFG_KSEL2_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL2 */
#define IFX_VADC_SHS_STEPCFG_KSEL2_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL3 */
#define IFX_VADC_SHS_STEPCFG_KSEL3_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL3 */
#define IFX_VADC_SHS_STEPCFG_KSEL3_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL3 */
#define IFX_VADC_SHS_STEPCFG_KSEL3_OFF (12)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL4 */
#define IFX_VADC_SHS_STEPCFG_KSEL4_LEN (3)

