HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL4 */
#define IFX_VADC_SHS_STEPCFG_KSEL4_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL4 */
#define IFX_VADC_SHS_STEPCFG_KSEL4_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL5 */
#define IFX_VADC_SHS_STEPCFG_KSEL5_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL5 */
#define IFX_VADC_SHS_STEPCFG_KSEL5_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL5 */
#define IFX_VADC_SHS_STEPCFG_KSEL5_OFF (20)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL6 */
#define IFX_VADC_SHS_STEPCFG_KSEL6_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL6 */
#define IFX_VADC_SHS_STEPCFG_KSEL6_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL6 */
#define IFX_VADC_SHS_STEPCFG_KSEL6_OFF (24)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL7 */
#define IFX_VADC_SHS_STEPCFG_KSEL7_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL7 */
#define IFX_VADC_SHS_STEPCFG_KSEL7_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL7 */
#define IFX_VADC_SHS_STEPCFG_KSEL7_OFF (28)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN0 */
#define IFX_VADC_SHS_STEPCFG_SEN0_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN0 */
#define IFX_VADC_SHS_STEPCFG_SEN0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN0 */
#define IFX_VADC_SHS_STEPCFG_SEN0_OFF (3)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN1 */
#define IFX_VADC_SHS_STEPCFG_SEN1_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN1 */
#define IFX_VADC_SHS_STEPCFG_SEN1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN1 */
#define IFX_VADC_SHS_STEPCFG_SEN1_OFF (7)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN2 */
#define IFX_VADC_SHS_STEPCFG_SEN2_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN2 */
#define IFX_VADC_SHS_STEPCFG_SEN2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN2 */
#define IFX_VADC_SHS_STEPCFG_SEN2_OFF (11)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN3 */
#define IFX_VADC_SHS_STEPCFG_SEN3_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN3 */
#define IFX_VADC_SHS_STEPCFG_SEN3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN3 */
#define IFX_VADC_SHS_STEPCFG_SEN3_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN4 */
#define IFX_VADC_SHS_STEPCFG_SEN4_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN4 */
#define IFX_VADC_SHS_STEPCFG_SEN4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN4 */
#define IFX_VADC_SHS_STEPCFG_SEN4_OFF (19)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN5 */
#define IFX_VADC_SHS_STEPCFG_SEN5_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN5 */
#define IFX_VADC_SHS_STEPCFG_SEN5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN5 */
#define IFX_VADC_SHS_STEPCFG_SEN5_OFF (23)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN6 */
#define IFX_VADC_SHS_STEPCFG_SEN6_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN6 */
#define IFX_VADC_SHS_STEPCFG_SEN6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN6 */
#define IFX_VADC_SHS_STEPCFG_SEN6_OFF (27)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN7 */
#define IFX_VADC_SHS_STEPCFG_SEN7_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN7 */
#define IFX_VADC_SHS_STEPCFG_SEN7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN7 */
#define IFX_VADC_SHS_STEPCFG_SEN7_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_TIMCFG_Bits.AT */
#define IFX_VADC_SHS_TIMCFG_AT_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_TIMCFG_Bits.AT */
#define IFX_VADC_SHS_TIMCFG_AT_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_TIMCFG_Bits.AT */
#define IFX_VADC_SHS_TIMCFG_AT_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_TIMCFG_Bits.FCRT */
#define IFX_VADC_SHS_TIMCFG_FCRT_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS_TIMCFG_Bits.FCRT */
#define IFX_VADC_SHS_TIMCFG_FCRT_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS_TIMCFG_Bits.FCRT */
#define IFX_VADC_SHS_TIMCFG_FCRT_OFF (4)

/** \\brief  Length for Ifx_VADC_SHS_TIMCFG_Bits.SST */
#define IFX_VADC_SHS_TIMCFG_SST_LEN (6)

/** \\brief  Mask for Ifx_VADC_SHS_TIMCFG_Bits.SST */
#define IFX_VADC_SHS_TIMCFG_SST_MSK (0x3f)

/** \\brief  Offset for Ifx_VADC_SHS_TIMCFG_Bits.SST */
#define IFX_VADC_SHS_TIMCFG_SST_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS_TIMCFG_Bits.TGEN */
#define IFX_VADC_SHS_TIMCFG_TGEN_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_TIMCFG_Bits.TGEN */
#define IFX_VADC_SHS_TIMCFG_TGEN_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_TIMCFG_Bits.TGEN */
#define IFX_VADC_SHS_TIMCFG_TGEN_OFF (16)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXVADC_BF_H */
